system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
 (0 -1 0)     //0
 (0 -1.5 0)   //1
 (0 -2 0)     //2
 (0 2 0)      //3
 (0 1.5 0)    //4
 (0 1 0)      //5
 (0 -1 0.1)   //6
 (0 -1.5 0.1) //7
 (0 -2 0.1)   //8
 (0 2 0.1)    //9
 (0 1.5 0.1)  //10
 (0 1 0.1)    //11
);

blocks
(
    hex (0 1 4 5 6 7 10 11) (80 400 1) simpleGrading (2.5 1 1)
    hex (1 2 3 4 7 8 9 10) (80 400 1) simpleGrading (0.4 1 1)
);

edges
(
 spline 5 0
 (
  (0.025 0.998749218 0)
  (0.05 0.994987437 0)
  (0.075 0.9886859967 0)
  (0.1 0.9797958971 0)
  (0.125 0.9682458366 0)
  (0.15 0.9539392014 0)
  (0.175 0.9367496998 0)
  (0.2 0.916515139 0)
  (0.225 0.893028555 0)
  (0.25 0.8660254038 0)
  (0.275 0.8351646544 0)
  (0.3 0.8 0)
  (0.325 0.7599342077 0)
  (0.35 0.7141428429 0)
  (0.375 0.6614378278 0)
  (0.4 0.6 0)
  (0.425 0.5267826876 0)
  (0.45 0.4358898944 0)
  (0.475 0.3122498999 0)
  (0.48 0.28 0)
  (0.485 0.2431049156 0)
  (0.49 0.1989974874 0)
  (0.495 0.1410673598 0)
  (0.496 0.1262378707 0)
  (0.497 0.1093800713 0)
  (0.498 0.0893532316 0)
  (0.499 0.0632139225 0)
  (0.499 -0.0632139225 0)
  (0.498 -0.0893532316 0)
  (0.497 -0.1093800713 0)
  (0.496 -0.1262378707 0)
  (0.495 -0.1410673598 0)
  (0.49 -0.1989974874 0)
  (0.485 -0.2431049156 0)
  (0.48 -0.28 0)
  (0.475 -0.3122498999 0)
  (0.45 -0.4358898944 0)
  (0.425 -0.5267826876 0)
  (0.4 -0.6 0)
  (0.375 -0.6614378278 0)
  (0.35 -0.7141428429 0)
  (0.325 -0.7599342077 0)
  (0.3 -0.8 0)
  (0.275 -0.8351646544 0)
  (0.25 -0.8660254038 0)
  (0.225 -0.893028555 0)
  (0.2 -0.916515139 0)
  (0.175 -0.9367496998 0)
  (0.15 -0.9539392014 0)
  (0.125 -0.9682458366 0)
  (0.1 -0.9797958971 0)
  (0.075 -0.9886859967 0)
  (0.05 -0.994987437 0)
  (0.025 -0.998749218 0)
 )
 
 spline 11 6
 (
  (0.025 0.998749218 0.1)
  (0.05 0.994987437 0.1)
  (0.075 0.9886859967 0.1)
  (0.1 0.9797958971 0.1)
  (0.125 0.9682458366 0.1)
  (0.15 0.9539392014 0.1)
  (0.175 0.9367496998 0.1)
  (0.2 0.916515139 0.1)
  (0.225 0.893028555 0.1)
  (0.25 0.8660254038 0.1)
  (0.275 0.8351646544 0.1)
  (0.3 0.8 0.1)
  (0.325 0.7599342077 0.1)
  (0.35 0.7141428429 0.1)
  (0.375 0.6614378278 0.1)
  (0.4 0.6 0.1)
  (0.425 0.5267826876 0.1)
  (0.45 0.4358898944 0.1)
  (0.475 0.3122498999 0.1)
  (0.48 0.28 0.1)
  (0.485 0.2431049156 0.1)
  (0.49 0.1989974874 0.1)
  (0.495 0.1410673598 0.1)
  (0.496 0.1262378707 0.1)
  (0.497 0.1093800713 0.1)
  (0.498 0.0893532316 0.1)
  (0.499 0.0632139225 0.1)
  (0.499 -0.0632139225 0.1)
  (0.498 -0.0893532316 0.1)
  (0.497 -0.1093800713 0.1)
  (0.496 -0.1262378707 0.1)
  (0.495 -0.1410673598 0.1)
  (0.49 -0.1989974874 0.1)
  (0.485 -0.2431049156 0.1)
  (0.48 -0.28 0.1)
  (0.475 -0.3122498999 0.1)
  (0.45 -0.4358898944 0.1)
  (0.425 -0.5267826876 0.1)
  (0.4 -0.6 0.1)
  (0.375 -0.6614378278 0.1)
  (0.35 -0.7141428429 0.1)
  (0.325 -0.7599342077 0.1)
  (0.3 -0.8 0.1)
  (0.275 -0.8351646544 0.1)
  (0.25 -0.8660254038 0.1)
  (0.225 -0.893028555 0.1)
  (0.2 -0.916515139 0.1)
  (0.175 -0.9367496998 0.1)
  (0.15 -0.9539392014 0.1)
  (0.125 -0.9682458366 0.1)
  (0.1 -0.9797958971 0.1)
  (0.075 -0.9886859967 0.1)
  (0.05 -0.994987437 0.1)
  (0.025 -0.998749218 0.1)
 )
 
 arc 2 3 (1 1.732050808 0)
 arc 8 9 (1 1.732050808 0.1)
 arc 1 4 (1 1.118033989 0)
 arc 7 10 (1 1.118033989 0.1)

);

boundary
(
    inner
    {
        type wall;
        faces
        (
            (11 5 0 6)
          
        );
    }
    outer
    {
        type wall;
        faces
        (
            (3 9 8 2)
          
        );
    }
    frontAndBack
    {
      type empty;
      faces
      (
       (5 4 1 0)
       (4 3 2 1)
       (6 7 10 11)
       (7 8 9 10)
      );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
